app/views/participants/scanner.html.erb

      <div class="card-body">
        <% recent_scans = Participant.scanned.order(scanned_at: :desc).limit(5) %>
---
SELECT "participants".* FROM "participants" WHERE "participants"."scanned_at" IS NOT NULL ORDER BY "participants"."scanned_at" DESC LIMIT 5