app/controllers/participants_controller.rb

  def set_participant
    @participant = Participant.find(params[:id])
---
SELECT "participants".* FROM "participants" WHERE "participants"."id" = 1 LIMIT 1