app/controllers/participants_controller.rb

  def index
    @participants = Participant.all
    @confirmed_count = Participant.confirmed.count
---
SELECT COUNT(*) FROM "participants" WHERE "participants"."confirmed" = TRUE

  def create
    @participant = Participant.new(participant_params)

    if @participant.save
---
INSERT INTO "participants" ("first_name", "last_name", "email", "confirmed", "qr_code", "scanned_at", "created_at", "updated_at") VALUES ('Test', 'Testing', 'test@testing.com', NULL, NULL, NULL, '2025-08-19 12:46:26.963690', '2025-08-19 12:46:26.963690') RETURNING "id"

  def scan
    if @participant.scanned_at.present?
      redirect_to @participant, alert: "Ten kod QR został już zeskanowany."
    else
      @participant.update(scanned_at: Time.current)
---
UPDATE "participants" SET "confirmed" = TRUE, "updated_at" = '2025-08-19 12:51:23.094591' WHERE "participants"."id" = 1

  def confirm
    if @participant.confirmed?
      redirect_to @participant, notice: "Rejestracja została już wcześniej potwierdzona!"
    else
      @participant.update(confirmed: true)
---
UPDATE "participants" SET "confirmed" = TRUE, "updated_at" = '2025-08-19 12:51:23.094591' WHERE "participants"."id" = 1

  def admin
    @participants = Participant.all
    @statistics = {
      total: Participant.count,
      confirmed: Participant.confirmed.count,
      scanned: Participant.scanned.count,
      attendance_percentage: Participant.attendance_percentage
---
SELECT "participants".* FROM "participants"
SELECT COUNT(*) FROM "participants" WHERE "participants"."confirmed" = TRUE

  def reset_confirmed
    if @participant.confirmed?
      @participant.update(confirmed: false, qr_code: nil)
---
UPDATE "participants" SET "scanned_at" = '2025-09-15 16:47:09.585793', "updated_at" = '2025-09-15 16:47:09.588485' WHERE "participants"."id" = 3

  def process_scan
    # Extract participant ID from scanned URL
    scanned_url = params[:scanned_url]

    if scanned_url.include?("/participants/") && scanned_url.include?("/scan")
      participant_id = scanned_url.match(/\/participants\/(\d+)\/scan/)[1]
      @participant = Participant.find(participant_id)

      if @participant.scanned_at.present?
        flash[:alert] = "#{@participant.full_name} - Ten kod QR został już zeskanowany."
      else
        @participant.update(scanned_at: Time.current)
---
SELECT "participants".* FROM "participants" WHERE "participants"."id" = 1 LIMIT 1
UPDATE "participants" SET "scanned_at" = '2025-09-15 16:47:09.585793', "updated_at" = '2025-09-15 16:47:09.588485' WHERE "participants"."id" = 3

  def set_participant
    @participant = Participant.find(params[:id])
---
SELECT "participants".* FROM "participants" WHERE "participants"."id" = 4 LIMIT 1