app/models/participant.rb

SELECT COUNT(*) FROM "participants" WHERE "participants"."confirmed" = TRUE
---
  def self.attendance_percentage
    return 0 if confirmed.count == 0
    (scanned.count.to_f / confirmed.count * 100).round(2)